/************************************************************
 * 版权：2025CIMC Copyright。
 * 文件：usart.h
 * 作者: Jialei Zhao
 * 平台: 2025CIMC IHD-V04
 * 版本: Jialei Zhao     2026/2/4     V0.01    original
************************************************************/
#ifndef __USART_H__
#define __USART_H__
/************************* 头文件 *************************/

#include "HeaderFiles.h"
/************************* 宏定义 *************************/
/* BootLoader 官方 App 工程与 BootLoader 默认串口波特率保持一致。 */
#define USART_DEFAULT_BAUDRATE 460800U

/************************ 全局变量定义 ************************/

/************************ 函数定义 ************************/

void my_usart_init(void);

#endif // !__USART_H__


/****************************End*****************************/

